[
  {
    "pergunta": "📅 Calendário Acadêmico",
    "variacoes": ["Qual o calendário acadêmico?", "Datas das aulas", "Calendário"],
    "resposta": "Você pode acessar o calendário acadêmico pelo site: https://www.ufc.br/calendario-universitario/2025",
    "tags": ["calendário", "datas", "aulas"]
  },
  {
    "pergunta": "📝 Como se Matricular",
    "variacoes": ["Como faço minha matrícula?", "Preciso me matricular", "Matricular disciplinas"],
    "resposta": "A matrícula é feita pelo SIGAA: https://www.si3.ufc.br/sigaa com suas credenciais.",
    "tags": ["matricula", "disciplinas", "inscrição"]
  },
  {
    "pergunta": "🔄 Trancamento/Cancelamento",
    "variacoes": ["Como trancar uma disciplina?", "Quero cancelar minha matrícula", "Trancamento de semestre"],
    "resposta": "Acesse o SIGAA no menu 'Ensino' > 'Trancamento'. Dúvidas? Fale com a secretaria ou veja em https://es.quixada.ufc.br/documentos.",
    "tags": ["trancamento", "cancelamento", "disciplinas"]
  },
  {
    "pergunta": "📊 Histórico Escolar",
    "variacoes": ["Como vejo meu histórico?", "Quero meu histórico", "Histórico de notas"],
    "resposta": "Seu histórico escolar está disponível no SIGAA em: 'Ensino' > 'Consultar Histórico'.",
    "tags": ["histórico", "notas", "disciplinas"]
  },
  {
    "pergunta": "Duvidas Frequentes",
    "variacoes": ["Onde posso tirar dúvidas?", "Onde posso encontrar ajuda?", "Onde posso obter suporte?"],
    "resposta": "Para tirar dúvidas, acesse o site: https://www.quixada.ufc.br/duvidas-frequentes/",
    "tags": ["ajuda", "suporte", "duvidas"]
    
  },
  {
  "pergunta": "Fale com a Coordenação",
  "variacoes": ["Como falar com a coordenação?", "Quero falar com a coordenação", "Contato da coordenação", "Preciso da coordenação"],
  "resposta": "Você pode entrar em contato com a coordenação do curso de Engenharia de Software pelo email: es@quixada.ufc.br ou presencialmente na sala da coordenação no campus.",
  "tags": ["coordenação", "contato", "ajuda"]
},
  {
    "intent": "resposta_0",
    "pergunta": "O que é o Estágio Curricular Supervisionado?",
    "resposta": "📚 O Estágio Curricular Supervisionado é uma atividade obrigatória que integra teoria e prática profissional. Desenvolvido em ambientes reais de trabalho, ele: \n\n• Complementa sua formação acadêmica \n• Tem carga horária definida no projeto pedagógico \n• É regulamentado pela UFC \n\n🔍 *Dica:* Consulte o Art. 1º do regulamento no site da coordenação.",
    "variacoes": [
      "Qual o objetivo do estágio supervisionado?",
      "Para que serve o estágio curricular?",
      "Explique sobre o estágio obrigatório"
    ],
    "tags": ["estágio", "curricular", "supervisionado"]
  },
  {
    "intent": "resposta_1",
    "pergunta": "Quais são os critérios para matrícula em estágio?",
    "resposta": "✅ Requisitos para matrícula em estágio: \n\n1. Matrícula regular no curso \n2. Cursar disciplinas pré-requisito \n3. Para estágio obrigatório: matrícula no componente correspondente \n\n📌 *Atenção:* Confira a lista completa no edital de estágio do seu curso.",
    "variacoes": [
      "Quais os requisitos para fazer estágio?",
      "Preciso de algo antes de me matricular no estágio?",
      "Como me inscrevo para estágio curricular?"
    ],
    "tags": ["matrícula", "requisitos", "estágio"]
  },
  {
    "intent": "resposta_2",
    "pergunta": "O que é o Termo de Compromisso de Estágio?",
    "resposta": "📝 O Termo de Compromisso de Estágio (TCE) é o documento que formaliza o estágio entre: \n\n• Universidade \n• Empresa concedente \n• Estudante \n\nEle deve conter: \n- Atividades a serem desenvolvidas \n- Carga horária \n- Duração \n- Supervisão \n\n🔗 *Modelo disponível:* Setor de Estágios da UFC",
    "variacoes": [
      "Para que serve o TCE?",
      "O que é o documento de estágio?",
      "Preciso assinar algum termo para estágio?"
    ],
    "tags": ["termo", "documento", "estágio"]
  },
  {
    "intent": "resposta_3",
    "pergunta": "O que é o Núcleo de Práticas da UFC em Quixadá?",
    "resposta": "🏛️ O Núcleo de Práticas (como o NPI) é uma unidade que permite: \n\n• Aplicar conhecimentos em projetos reais \n• Desenvolver soluções tecnológicas \n• Integrar ensino e prática profissional \n\n📍 *Localização:* Bloco 4, 1º andar \n🕒 *Funcionamento:* Seg-Sex, 8h-17h",
    "variacoes": [
      "O que faz o Núcleo de Práticas?",
      "Como participar do NPI?",
      "Onde fica o núcleo de informática?"
    ],
    "tags": ["núcleo", "práticas", "projetos"]
  },
  {
    "intent": "resposta_4",
    "pergunta": "Quais são as modalidades de estágio curricular supervisionado?",
    "resposta": "🔹 **Estágio Obrigatório:** \n- Definido no projeto pedagógico \n- Requisito para diploma \n\n🔹 **Estágio Não Obrigatório:** \n- Atividade opcional \n- Acréscimo à carga horária \n\n📊 *Carga horária típica:* 300-400 horas",
    "variacoes": [
      "Tipos de estágio na UFC",
      "Diferença entre estágio obrigatório e não obrigatório",
      "Quantas modalidades de estágio existem?"
    ],
    "tags": ["modalidades", "estágio", "tipos"]
  },
  {
    "intent": "resposta_5",
    "pergunta": "Como são realizados os estágios externos?",
    "resposta": "🏢 **Estágio Externo:** \n\n1. Empresa deve ter convênio com a UFC \n2. Necessário: \n   - Supervisor na empresa \n   - Professor orientador \n   - Termo de Compromisso \n\n🌐 *Lista de empresas conveniadas:* Disponível no SIGAA",
    "variacoes": [
      "Como estagiar em empresas?",
      "Procedimento para estágio externo",
      "Preciso de convênio para estágio?"
    ],
    "tags": ["externo", "empresa", "convênio"]
  },
  {
    "intent": "resposta_6",
    "pergunta": "Como são realizados os estágios internos?",
    "resposta": "🏫 **Estágio Interno:** \n\n• Desenvolvido dentro da UFC (ex: NPI) \n• Inclui as disciplinas: \n   - Estágio Supervisionado I \n   - Estágio Supervisionado II \n\n📌 *Requisito:* Compatibilidade com o projeto pedagógico",
    "variacoes": [
      "Como funciona estágio na universidade?",
      "O que é estágio interno?",
      "Posso estagiar no NPI?"
    ],
    "tags": ["interno", "UFC", "núcleo"]
  },
  {
    "intent": "resposta_7",
    "pergunta": "Qual a carga horária das atividades de estágio?",
    "resposta": "⏱️ Carga horária típica por curso: \n\n• Engenharia de Software: 320h \n• Ciência da Computação: 300h \n• Outros: Consultar projeto pedagógico \n\n📅 *Distribuição:* Normalmente 2 semestres",
    "variacoes": [
      "Quantas horas tem o estágio?",
      "Duração do estágio supervisionado",
      "Carga horária mínima para estágio"
    ],
    "tags": ["carga horária", "horas", "duração"]
  },
  {
    "intent": "resposta_8",
    "pergunta": "Como aproveitar experiência profissional como estágio?",
    "resposta": "💼 **Aproveitamento de Experiência:** \n\nDocumentos necessários: \n1. Carteira de trabalho ou contrato \n2. Relatório detalhado das atividades \n3. Comprovação de tempo de serviço \n\n📝 *Processo:* Solicitar na coordenação do curso",
    "variacoes": [
      "Posso validar trabalho como estágio?",
      "Como converter experiência em horas de estágio?",
      "Já trabalho na área, preciso estagiar?"
    ],
    "tags": ["experiência", "aproveitamento", "validar"]
  },
  {
    "intent": "resposta_9",
    "pergunta": "Quais são as responsabilidades do aluno em estágio?",
    "resposta": "📋 **Deveres do Estagiário:** \n\n1. Entregar Plano de Trabalho \n2. Cumprir programação e normas \n3. Elaborar Relatório Final \n4. Apresentar Seminário \n\n⚠️ *Atenção:* Prazos são rigorosos!",
    "variacoes": [
      "O que devo fazer durante o estágio?",
      "Quais obrigações tenho como estagiário?",
      "Documentos que preciso entregar no estágio"
    ],
    "tags": ["responsabilidades", "aluno", "deveres"]
  },
  {
    "intent": "resposta_10",
    "pergunta": "Quais são as responsabilidades do supervisor de estágio?",
    "resposta": "👔 **Atribuições do Supervisor:** \n\n• Orientar atividades práticas \n• Avaliar rendimento do estagiário \n• Garantir cumprimento do Termo \n• Emitir avaliação final \n\n📞 *Canais:* supervisor.estagios@ufc.br",
    "variacoes": [
      "O que faz o supervisor de estágio?",
      "Quem me avalia no estágio?",
      "Responsabilidades da empresa no estágio"
    ],
    "tags": ["supervisor", "empresa", "avaliação"]
  },  
  {
    "intent": "resposta_11",
    "pergunta": "Quais são as responsabilidades do professor orientador de estágio?",
    "resposta": "Cabe ao professor orientador: (I) Avaliar o Plano de Trabalho apresentado pelo discente; (II) Acompanhar o desenvolvimento do estágio; (III) Orientar o aluno na elaboração do relatório final; e (IV) Realizar a avaliação final do estagiário, considerando o relatório e a avaliação do supervisor."
  },
  {
    "intent": "resposta_12",
    "pergunta": "Como é realizada a avaliação do discente nas atividades de Estágio Curricular",
    "resposta": "A avaliação do discente nas atividades de Estágio Curricular Supervisionado é realizada pelo professor orientador e leva em conta a avaliação do supervisor na empresa, o relatório final de estágio apresentado pelo aluno, e, em alguns casos, a apresentação de um seminário. A ausência de documentos como o relatório final ou o termo de compromisso pode invalidar a atividade."
  },
  {
    "intent": "resposta_13",
    "pergunta": "O que acontece em caso de reprovação no estágio curricular supervisionado?",
    "resposta": "Em caso de reprovação, o discente deverá solicitar matrícula no componente curricular de estágio novamente no semestre seguinte em que a disciplina for ofertada. A reprovação pode ocorrer por não apresentar a documentação exigida, como o plano de trabalho ou o relatório final, dentro dos prazos estipulados."
  },
  {
    "intent": "resposta_14",
    "pergunta": "Como posso me inscrever como aluno especial na UFC?",
    "resposta": "O estudante deve se dirigir à coordenação de cada curso e, após consentimento, comparecer à Divisão de Seleção e Matrícula da Prograd."
  },
  {
    "intent": "resposta_15",
    "pergunta": "Qual é a documentação exigida para alunos especiais?",
    "resposta": "Cópias legíveis do diploma de graduação, documento de identidade e CPF são necessárias."
  },
  {
    "intent": "resposta_16",
    "pergunta": "A UFC oferece assistência estudantil?",
    "resposta": "Sim, a assistência estudantil inclui programas como Residência Universitária, Restaurante Universitário e Apoio Psicopedagógico."
  },
  {
    "intent": "resposta_17",
    "pergunta": "O que é a Educação à Distância (EaD)?",
    "resposta": "É um processo de ensino-aprendizagem mediado por tecnologia, onde professores e alunos não estão no mesmo espaço físico."
  },
  {
    "intent": "resposta_18",
    "pergunta": "Como é calculado o Índice de Rendimento Acadêmico (IRA) Geral?",
    "resposta": "O IRA Geral é calculado com base na média das notas dos alunos do mesmo curso, normalizada por desempenho."
  },
  {
    "intent": "resposta_19",
    "pergunta": "O que acontece se um aluno tiver a matrícula bloqueada?",
    "resposta": "O bloqueio ocorre após duas reprovações por frequência na mesma disciplina ou quatro reprovações em disciplinas do curso."
  },
  {
    "intent": "resposta_20",
    "pergunta": "Como posso solicitar o trancamento parcial de matrícula?",
    "resposta": "O aluno deve encaminhar solicitação à Coordenação de Curso dentro do prazo estabelecido pelo Calendário Universitário."
  },
  {
    "intent": "resposta_21",
    "pergunta": "Quais são os critérios para solicitar trancamento total de matrícula?",
    "resposta": "Doença, mudança de domicílio, emprego ou obrigação militar são algumas das situações que permitem o trancamento."
  },
  {
    "intent": "resposta_22",
    "pergunta": "O que é mobilidade acadêmica?",
    "resposta": "É o processo que permite ao aluno cursar disciplinas em outra Instituição Federal de Ensino Superior (IFES)."
  },
  {
    "intent": "resposta_23",
    "pergunta": "Como posso participar do programa de mobilidade acadêmica?",
    "resposta": "O aluno deve procurar o setor responsável na sua IFES de origem e seguir os procedimentos estabelecidos."
  },
  {
    "intent": "resposta_24",
    "pergunta": "É possível mudar de curso na UFC?",
    "resposta": "Sim, é possível, mas o aluno deve verificar as normas e critérios no edital de mudança de curso."
  },
  {
    "intent": "resposta_25",
    "pergunta": "Como funciona o Sistema de Seleção Unificada (SiSU) na UFC?",
    "resposta": "O SiSU utiliza a nota do Enem para selecionar alunos para os cursos da universidade, conforme edital específico."
  },
  {
    "intent": "resposta_26",
    "pergunta": "Quais são as condições para a transferência de outras IES para a UFC?",
    "resposta": "A transferência é regida por edital e depende da nota do Enem, além de outras condições."
  },
  {
    "intent": "resposta_27",
    "pergunta": "O que é o Auxílio Moradia?",
    "resposta": "É um benefício concedido a alunos em situação de vulnerabilidade socioeconômica, que pode ser acumulado com outras bolsas."
  },
  {
    "intent": "resposta_28",
    "pergunta": "Como é calculado o IRA Individual?",
    "resposta": "O IRA Individual é calculado com base nas notas e carga horária das disciplinas cursadas pelo aluno."
  },
  {
    "intent": "resposta_29",
    "pergunta": "Quais atividades complementares são consideradas para o IRA?",
    "resposta": "Atividades complementares de ensino não são incluídas no cálculo do IRA Individual."
  },
  {
    "intent": "resposta_30",
    "pergunta": "O que é o Auxílio Emergencial e quando pode ser solicitado?",
    "resposta": "É concedido em situações de emergência, como problemas de saúde ou limitações financeiras temporárias."
  },
  {
    "intent": "resposta_31",
    "pergunta": "Como posso consultar meu IRA?",
    "resposta": "O IRA pode ser consultado no histórico acadêmico do aluno."
  },
  {
    "intent": "resposta_32",
    "pergunta": "Qual é o limite de disciplinas que um aluno especial pode cursar na UFC?",
    "resposta": "O aluno especial não pode exceder cinco disciplinas e deve completar isso em até quatro semestres letivos."
  },
  {
    "intent": "resposta_33",
    "pergunta": "Quais são os critérios para solicitar mudança de curso na UFC?",
    "resposta": "Os critérios são estabelecidos em edital específico publicado pela Prograd, com base em IRA, vagas disponíveis e período cursado."
  },
  {
    "intent": "resposta_34",
    "pergunta": "Como funciona o Programa de Residência Universitária?",
    "resposta": "O programa oferece moradia estudantil aos alunos em situação de vulnerabilidade socioeconômica."
  },
  {
    "intent": "resposta_35",
    "pergunta": "Quais são os requisitos para receber o Auxílio Creche?",
    "resposta": "O aluno deve ter filhos entre 6 meses e 4 anos incompletos e comprovar a guarda da criança."
  },
  {
    "intent": "resposta_36",
    "pergunta": "O Auxílio Emergencial pode ser solicitado quantas vezes?",
    "resposta": "O aluno pode receber o auxílio emergencial até 4 vezes por ano letivo."
  },
  {
    "intent": "resposta_37",
    "pergunta": "Qual é o limite de bolsas que um aluno pode acumular?",
    "resposta": "O aluno só pode acumular o Auxílio Moradia com a Bolsa de Iniciação Acadêmica."
  },
  {
    "intent": "resposta_38",
    "pergunta": "Quanto tempo dura a Bolsa de Iniciação Acadêmica?",
    "resposta": "O aluno pode permanecer na bolsa por no máximo 20 meses, totalizando dois anos."
  },
  {
    "intent": "resposta_39",
    "pergunta": "Quais são os cursos de graduação semipresenciais oferecidos pela UFC?",
    "resposta": "As informações sobre os cursos semipresenciais podem ser obtidas diretamente no Instituto UFC Virtual."
  },
  {
    "intent": "resposta_40",
    "pergunta": "Como é feita a normalização do IRA Geral?",
    "resposta": "O IRA Geral é normalizado usando a média e o desvio padrão dos rendimentos dos alunos ativos de cada curso."
  },
  {
    "intent": "resposta_41",
    "pergunta": "Qual é o impacto de uma reprovação por falta no IRA?",
    "resposta": "A reprovação por falta tem um impacto negativo maior no IRA do que a reprovação por nota."
  },
  {
    "intent": "resposta_42",
    "pergunta": "Disciplinas aproveitadas entram no cálculo do IRA Individual?",
    "resposta": "Não, disciplinas aproveitadas, tanto interna quanto externamente, não são consideradas no cálculo do IRA Individual."
  },
  {
    "intent": "resposta_43",
    "pergunta": "Atividades complementares de ensino afetam o IRA Individual?",
    "resposta": "Não, atividades complementares de ensino não são incluídas no cálculo do IRA Individual."
  },
  {
    "intent": "resposta_44",
    "pergunta": "Qual é o procedimento para desbloquear a matrícula após reprovações por falta?",
    "resposta": "O aluno deve procurar a Coordenação de Curso para orientação e regularização da matrícula."
  },
  {
    "intent": "resposta_45",
    "pergunta": "Quais são os prazos para solicitar trancamento parcial ou total de matrícula?",
    "resposta": "Os prazos estão estabelecidos no Calendário Universitário da UFC."
  },
  {
    "intent": "resposta_46",
    "pergunta": "Quais documentos são necessários para solicitar trancamento total de matrícula?",
    "resposta": "Documentos comprobatórios da situação que justifica o trancamento, como atestado médico ou declaração de emprego."
  },
  {
    "intent": "resposta_47",
    "pergunta": "O trancamento parcial afeta o IRA Individual?",
    "resposta": "Sim, o trancamento parcial de matrícula afeta o cálculo do IRA Individual."
  },
  {
    "intent": "resposta_48",
    "pergunta": "Como funciona a mobilidade acadêmica entre IFESs?",
    "resposta": "O aluno deve procurar o setor responsável pela mobilidade em sua instituição de origem e seguir os procedimentos estabelecidos."
  },
  {
    "intent": "resposta_49",
    "pergunta": "Quais são os requisitos para participar do Programa de Mobilidade Acadêmica?",
    "resposta": "Os requisitos são definidos pela instituição de origem do aluno."
  },
  {
    "intent": "resposta_50",
    "pergunta": "O aluno especial pode cursar disciplinas em qualquer curso da UFC?",
    "resposta": "Não, o aluno especial deve obter consentimento da coordenação de cada curso para se matricular nas disciplinas desejadas."
  },
  {
    "intent": "resposta_51",
    "pergunta": "O aluno especial pode solicitar aproveitamento de disciplinas cursadas na UFC?",
    "resposta": "Sim, o aproveitamento de disciplinas deve ser solicitado no momento do ingresso no curso."
  },
  {
    "intent": "resposta_52",
    "pergunta": "Quais são os requisitos para solicitar mudança de curso via SiSU?",
    "resposta": "Os requisitos são estabelecidos em edital específico, com base na nota do Enem e em critérios definidos pela Prograd."
  },
  {
    "intent": "resposta_53",
    "pergunta": "Como funciona o processo de transferência de outras IES para a UFC?",
    "resposta": "A transferência é regida por edital específico e depende da nota do Enem, além de outros critérios estabelecidos."
  },
  {
    "intent": "resposta_54",
    "pergunta": "Quais são os benefícios oferecidos pelo Restaurante Universitário (RU)?",
    "resposta": "O RU oferece refeições subsidiadas aos alunos de graduação."
  },
  {
    "intent": "resposta_55",
    "pergunta": "Quais são as ações da Divisão Médico-Odontológica da PRAE?",
    "resposta": "A divisão oferece atendimento médico e odontológico aos alunos de graduação."
  },
  {
    "intent": "resposta_56",
    "pergunta": "O Apoio Psicopedagógico da PRAE oferece quais serviços?",
    "resposta": "O apoio inclui orientação psicológica e pedagógica aos alunos."
  },
  {
    "intent": "resposta_57",
    "pergunta": "Quais são as atividades de Desporto e Lazer oferecidas pela PRAE?",
    "resposta": "A PRAE promove atividades esportivas e de lazer para os alunos de graduação."
  },
  {
    "intent": "resposta_58",
    "pergunta": "Como o aluno pode obter informações sobre assistência estudantil?",
    "resposta": "O aluno deve procurar diretamente a Pró-Reitoria de Assuntos Estudantis (PRAE)."
  },
  {
    "intent": "resposta_59",
    "pergunta": "Qual é a carga horária mínima do Estágio Curricular Supervisionado?",
    "resposta": "A carga horária mínima é de 300 horas, conforme estabelecido no Art. 1º do regulamento."
  },
  {
    "intent": "resposta_60",
    "pergunta": "O estágio pode ser realizado em qualquer período do curso?",
    "resposta": "Não, o estágio deve ser realizado a partir do 7º semestre, conforme previsto no Art. 2º."
  },
  {
    "intent": "resposta_61",
    "pergunta": "Quais são os objetivos do Estágio Curricular Supervisionado?",
    "resposta": "O estágio visa proporcionar ao discente a aplicação prática dos conhecimentos adquiridos durante o curso."
  },
  {
    "intent": "resposta_62",
    "pergunta": "Quem é responsável pela supervisão do estágio?",
    "resposta": "O estágio é supervisionado por um professor orientador designado pela coordenação do curso, conforme Art. 4º."
  },
  {
    "intent": "resposta_63",
    "pergunta": "Qual é o papel do professor orientador?",
    "resposta": "O professor orientador acompanha e avalia o desenvolvimento do estágio, conforme Art. 4º."
  },
  {
    "intent": "resposta_64",
    "pergunta": "O estágio pode ser realizado em mais de um local?",
    "resposta": "Sim, o estágio pode ser realizado em mais de um local, desde que a carga horária mínima seja cumprida, de acordo com o Art. 6º."
  },
  {
    "intent": "resposta_65",
    "pergunta": "Quais são os requisitos para aprovação no estágio?",
    "resposta": "Para aprovação, o discente deve cumprir a carga horária mínima e obter aproveitamento satisfatório, conforme Art. 7º."
  },
  {
    "intent": "resposta_66",
    "pergunta": "Como é feita a avaliação do estágio?",
    "resposta": "A avaliação é realizada pelo professor orientador, com base no relatório final apresentado pelo discente, conforme Art. 7º."
  },
  {
    "intent": "resposta_67",
    "pergunta": "O estágio pode ser realizado em outra cidade?",
    "resposta": "Sim, o estágio pode ser realizado em outra cidade, desde que haja concordância da coordenação do curso, conforme Art. 6º."
  },
  {
    "intent": "resposta_68",
    "pergunta": "Existe alguma bolsa ou auxílio para realização do estágio?",
    "resposta": "O regulamento não menciona a existência de bolsas ou auxílios específicos para a realização do estágio."
  },
  {
    "intent": "resposta_69",
    "pergunta": "O estágio pode ser realizado em horário noturno ou aos finais de semana?",
    "resposta": "Sim, desde que respeitada a carga horária máxima semanal estabelecida pela legislação trabalhista, conforme Art. 6º."
  },
  {
    "intent": "resposta_70",
    "pergunta": "Quais são os documentos necessários para iniciar o estágio?",
    "resposta": "O discente deve apresentar o Termo de Compromisso de Estágio devidamente preenchido e assinado, conforme Art. 5º."
  },
  {
    "intent": "resposta_71",
    "pergunta": "O estágio pode ser realizado em empresa de propriedade da família do discente?",
    "resposta": "Não há menção a essa possibilidade no regulamento."
  },
  {
    "intent": "resposta_72",
    "pergunta": "Existe algum seguro para o discente durante o estágio?",
    "resposta": "O regulamento não menciona a existência de seguro específico para o estágio."
  },
  {
    "intent": "resposta_73",
    "pergunta": "O discente pode receber alguma remuneração durante o estágio?",
    "resposta": "O regulamento não menciona a possibilidade de remuneração durante o estágio."
  },
  {
    "intent": "resposta_74",
    "pergunta": "Quais são as penalidades em caso de descumprimento do regulamento?",
    "resposta": "O regulamento não especifica as penalidades em caso de descumprimento."
  },
  {
    "intent": "resposta_75",
    "pergunta": "O estágio pode ser realizado no exterior?",
    "resposta": "O regulamento não menciona a possibilidade de realização do estágio no exterior."
  },
  {
    "intent": "resposta_76",
    "pergunta": "Existe algum prazo para entrega do relatório final?",
    "resposta": "O regulamento não menciona um prazo específico para entrega do relatório final."
  },
  {
    "intent": "resposta_77",
    "pergunta": "O discente pode realizar o estágio em mais de uma instituição simultaneamente?",
    "resposta": "O regulamento não menciona essa possibilidade."
  },
  {
    "intent": "resposta_78",
    "pergunta": "Existe algum modelo ou formato padrão para o relatório final?",
    "resposta": "O regulamento não especifica um modelo ou formato padrão para o relatório final."
  },
  {
    "intent": "resposta_79",
    "pergunta": "Como faço para solicitar a quebra de pré-requisito para cursar a disciplina 'X'?",
    "resposta": "A solicitação de quebra de pré-requisito deve ser feita via formulário específico, disponível no site da coordenação. Você precisará da justificativa do professor da disciplina que deseja cursar e seu histórico acadêmico. O pedido será analisado pelo colegiado do curso."
  },
  {
    "intent": "resposta_80",
    "pergunta": "Perdi o prazo da matrícula curricular. Qual o procedimento para o ajuste de matrícula e quais as datas?",
    "resposta": "Após a matrícula curricular, há o período de ajuste de matrícula. As datas são sempre divulgadas no Calendário Universitário. Você deve realizar a solicitação de inclusão de disciplinas pelo SIGAA nesse período. Em casos excepcionais, procure a coordenação com uma justificativa formal."
  },
  {
    "intent": "resposta_81",
    "pergunta": "A turma de 'Inteligência Artificial' está lotada. Existe a possibilidade de serem ofertadas mais vagas ou uma nova turma?",
    "resposta": "A criação de novas vagas ou turmas depende da disponibilidade do professor e do departamento. Envie um e-mail para a coordenação com seu nome e o de outros interessados para que possamos avaliar a demanda e verificar a possibilidade junto ao professor responsável."
  },
  {
    "intent": "resposta_82",
    "pergunta": "Quais as disciplinas optativas de Engenharia de Software serão ofertadas no próximo semestre?",
    "resposta": "A lista de disciplinas optativas é definida semestralmente e divulgada no site do curso, geralmente um mês antes do período de matrícula. Fique atento aos comunicados da coordenação por e-mail e nos canais oficiais."
  },
  {
    "intent": "resposta_83",
    "pergunta": "Estou com dificuldades em 'Cálculo Vetorial'. Existe algum monitor para essa disciplina ou grupo de estudos recomendado pela coordenação?",
    "resposta": "Sim, geralmente as disciplinas de base como Cálculo possuem monitores. Você pode consultar a lista de monitores e seus horários no site do seu curso ou do Departamento de Computação. A coordenação também incentiva a formação de grupos de estudo entre os alunos."
  },
  {
    "intent": "resposta_84",
    "pergunta": "Até quando posso solicitar o cancelamento justificado de uma disciplina sem afetar meu IRA?",
    "resposta": "O trancamento parcial de matrícula, que é o cancelamento de uma ou mais disciplinas, pode ser solicitado via SIGAA dentro do prazo estabelecido no Calendário Universitário. Fique atento, pois o cancelamento fora do prazo só é permitido em casos excepcionais e documentados."
  },
  {
    "intent": "resposta_85",
    "pergunta": "A coordenação tem uma lista de empresas de tecnologia na região com convênio ativo para estágio?",
    "resposta": "Sim, a coordenação possui uma lista de empresas parceiras. Além disso, o Setor de Estágios da UFC mantém um portal com as oportunidades e empresas conveniadas. Você pode consultar ambos para encontrar uma vaga."
  },
  {
    "intent": "resposta_86",
    "pergunta": "Meu Termo de Compromisso de Estágio precisa ser assinado. Qual o fluxo correto? Devo entregar a via física na coordenação ou o processo é online?",
    "resposta": "Atualmente, o fluxo de assinatura do Termo de Compromisso de Estágio (TCE) é feito pelo SEI (Sistema Eletrônico de Informações). Você deve iniciar um processo, anexar o termo preenchido e assinado por você e pela empresa, e encaminhar para a assinatura da coordenação e do setor de estágios."
  },
  {
    "intent": "resposta_87",
    "pergunta": "Já trabalho na área de desenvolvimento. Como posso validar minha experiência profissional como estágio obrigatório?",
    "resposta": "Você pode solicitar o aproveitamento de atuação profissional. Para isso, é necessário apresentar documentos como carteira de trabalho assinada ou contrato de prestação de serviços, além de um relatório detalhado das atividades que você exerce, comprovando a compatibilidade com a área do curso."
  },
  {
    "intent": "resposta_88",
    "pergunta": "Como é definido o meu professor orientador de estágio? Eu posso escolher?",
    "resposta": "O aluno pode conversar com um professor que tenha afinidade com a área do seu estágio e convidá-lo para ser seu orientador. Após o aceite do professor, você deve informar o nome dele à coordenação no momento da formalização do estágio."
  },
  {
    "intent": "resposta_89",
    "pergunta": "Onde encontro as linhas de pesquisa dos professores de Engenharia de Software para escolher um orientador de TCC?",
    "resposta": "As linhas de pesquisa de cada professor estão disponíveis no site do curso, na seção 'Corpo Docente'. Recomenda-se também verificar as publicações recentes dos professores na plataforma Lattes para entender seus interesses atuais de pesquisa."
  },
  {
    "intent": "resposta_90",
    "pergunta": "Quais são os prazos para depósito da proposta e da versão final do TCC neste semestre?",
    "resposta": "Os prazos para todas as etapas do TCC (proposta, qualificação, depósito e defesa) são definidos no início de cada semestre e publicados em um edital específico no site do curso. Consulte o edital de TCC do semestre vigente."
  },
  {
    "intent": "resposta_91",
    "pergunta": "Existe um template/modelo oficial da UFC Quixadá para a formatação do documento do TCC?",
    "resposta": "Sim. O modelo oficial para formatação de trabalhos acadêmicos, incluindo o TCC, segue as normas da ABNT e está disponível para download no site da Biblioteca do Campus."
  },
  {
    "intent": "resposta_92",
    "pergunta": "É possível desenvolver o TCC em parceria com uma empresa? Qual o procedimento nesse caso?",
    "resposta": "Sim, é possível e incentivado. Você precisará de um professor orientador da UFC e um supervisor na empresa. O plano de trabalho do TCC deve ser aprovado por ambos, e pode ser necessário um termo de confidencialidade, dependendo do projeto."
  },
  {
    "intent": "resposta_93",
    "pergunta": "Participei de um hackathon no fim de semana. Isso conta como atividade complementar? Como faço para registrar as horas?",
    "resposta": "Sim, participação em hackathons, competições de programação e eventos similares contam como atividades complementares. Para registrar, você deve abrir um processo de aproveitamento de horas no SIGAA e anexar o certificado de participação."
  },
  {
    "intent": "resposta_94",
    "pergunta": "Cursos da Alura, Coursera ou outras plataformas podem ser validados como atividade complementar? Qual a carga horária?",
    "resposta": "Sim, cursos online relevantes para a área de Engenharia de Software podem ser validados. A carga horária aproveitada é definida pelo regulamento de atividades complementares e analisada pelo seu coordenador. Geralmente, há um limite máximo de horas para essa categoria."
  },
  {
    "intent": "resposta_95",
    "pergunta": "Meu IRA está baixo. Quais estratégias a coordenação recomenda para que eu possa recuperá-lo?",
    "resposta": "Recomendamos focar em um número menor de disciplinas por semestre para garantir um bom desempenho. Procure os monitores e professores para tirar dúvidas, participe de grupos de estudo e organize um cronograma. Se necessário, agende uma conversa com o coordenador para montar um plano de estudos."
  },
  {
    "intent": "resposta_96",
    "pergunta": "Preciso usar o Laboratório de Redes e Hardware (LARD) para um projeto. Qual o procedimento para ter acesso fora do horário de aula?",
    "resposta": "O acesso aos laboratórios fora do horário de aula precisa ser solicitado à chefia do departamento. Normalmente, é necessário preencher um formulário com a justificativa do projeto e o acompanhamento de um professor ou monitor responsável."
  },
  {
    "intent": "resposta_97",
    "pergunta": "Como posso saber sobre os próximos eventos de tecnologia, palestras ou workshops que acontecerão no campus?",
    "resposta": "A melhor forma é acompanhar os canais de comunicação do curso: o site oficial, os grupos de e-mail e as redes sociais. O Centro Acadêmico (C.A.) do curso também divulga ativamente todos os eventos."
  },
  {
    "intent": "resposta_98",
    "pergunta": "Não estou me sentindo bem academicamente e emocionalmente. A UFC Quixadá oferece algum tipo de apoio psicopedagógico?",
    "resposta": "Sim, a UFC oferece apoio através da Pró-Reitoria de Assuntos Estudantis (PRAE). No campus de Quixadá, você pode procurar o setor responsável para agendar uma conversa e receber orientação psicológica e pedagógica. Não hesite em buscar ajuda."
  },
  {
    "intent": "resposta_99",
    "pergunta": "Quais são os procedimentos para solicitar a revisão de uma nota de disciplina?",
    "resposta": "Para solicitar a revisão de nota, você deve formalizar o pedido por escrito ao professor responsável pela disciplina, dentro do prazo estipulado no regulamento acadêmico. Caso não obtenha resposta satisfatória, pode recorrer à coordenação do curso."
  },
  {
    "intent": "resposta_100",
    "pergunta": "Como posso participar de projetos de extensão ou pesquisa na UFC Quixadá?",
    "resposta": "Você pode se inscrever em projetos de extensão e pesquisa através do site do curso ou diretamente com os professores. Fique atento aos editais e chamadas para participação, que são divulgados periodicamente."
  },
  {
    "intent": "resposta_101",
    "pergunta": "Quais são os critérios para a concessão de bolsas de iniciação científica?",
    "resposta": "As bolsas de iniciação científica são concedidas com base em edital específico, que considera o desempenho acadêmico (IRA), a relevância do projeto de pesquisa e a disponibilidade orçamentária. É necessário ter um orientador vinculado ao curso."
  },
  {
    "intent": "resposta_102",
    "pergunta": "Como posso me inscrever para o programa de intercâmbio acadêmico?",
    "resposta": "As inscrições para o programa de intercâmbio acadêmico são feitas através do site da Pró-Reitoria de Relações Internacionais (PRRI). Fique atento aos editais e prazos específicos para cada semestre."
  },
  {
    "intent": "resposta_103",
    "pergunta": "Quais são as oportunidades de estágio oferecidas pelo Núcleo de Práticas da UFC Quixadá?",
    "resposta": "O Núcleo de Práticas oferece estágios em diversas áreas, principalmente em projetos de tecnologia e inovação. As oportunidades são divulgadas no site do núcleo e nas redes sociais."
  },
  {
    "intent": "resposta_104",
    "pergunta": "Como posso participar do Centro Acadêmico (C.A.) do curso?",
    "resposta": "Para participar do C.A., você pode se inscrever nas eleições anuais ou entrar em contato com os membros atuais para saber como contribuir com as atividades e eventos promovidos pelo centro."
  }
  
]